/*:
 # Quick Tour
 Playgroundファイルを開くと、いま見ているような`エディタ（編集画面）`が表示されます。\
 この教材ファイルを使用するには、メニューバーから`「Editor > Show Rendered Markup」`をクリックします。

 \
 PlaygroundはSwiftコードを試すことができる`インタラクティブな環境`です。\
 エディタでは記述したコードを1行ずつ実行して、その結果を確認できます。\
 「コードを実行した結果」は、右側にある __`リザルトサイドバー`__ に表示されます。

 * NOTE:
    リザルトサイドバーは「通常のXcodeプロジェクト」のエディタにはありません。
 
 \
 それでは、左側の青いラインに注目してください。
 */
"プレイボタンは、ポインタがある行に表示されます。"
"青くなっている行は、「コードが実行できる」ことを示しています。"
"この行でプレイボタンを押してみましょう。"
"プレイボタンを含む青い行のコードがすべて実行され、その結果が右側に表示されました。"
"灰色になった行は、「コードが実行された」ことを示しています。"
"なお、「実行した結果」は、画面下にあるストップボタンでリセットできます。"
"ストップボタンをクリックすると、リザルトサイドバーに表示されている実行結果はグレーアウトします。"
"Playgorundがリセットされると、ストップボタンは実行ボタンに変化します。"
"実行ボタンをクリックすると、すべてのコードが実行されます。"
/*:
 下のリンクをクリックして、次のページへ進みましょう。\
 [次のページに進む](@next)
 */
